## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
To view this run in a browser, visit:
https://app.terraform.io/app/OzOrgTest/TestOzOrg/runs/run-5jBnbNFEDDLFNFzV

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.avm-res-maintenance-maintenanceconfiguration.azapi_resource.maintenance_configuration will be updated in-place
  ~ resource "azapi_resource" "maintenance_configuration" {
      ~ body                      = {
          ~ properties = {
              ~ maintenanceWindow   = {
                  ~ duration           = "01:30" -> "2:00"
                    # (4 unchanged attributes hidden)
                }
                # (4 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/4bcc135f-80a8-482f-b67b-fc849aa4b7ac/resourceGroups/Testrg1/providers/Microsoft.Maintenance/maintenanceConfigurations/TestConfig"
        name                      = "TestConfig"
      ~ output                    = {
          - id         = "/subscriptions/4bcc135f-80a8-482f-b67b-fc849aa4b7ac/resourcegroups/testrg1/providers/microsoft.maintenance/maintenanceconfigurations/testconfig"
          - properties = {
              - extensionProperties = {
                  - InGuestPatchMode = "User"
                }
              - installPatches      = {
                  - linuxParameters   = {
                      - classificationsToInclude = [
                          - "Critical",
                          - "Security",
                        ]
                    }
                  - windowsParameters = {
                      - classificationsToInclude = [
                          - "Critical",
                          - "Security",
                        ]
                    }
                }
            }
          - type       = "Microsoft.Maintenance/maintenanceConfigurations"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.avm-res-maintenance-maintenanceconfiguration2.azapi_resource.maintenance_configuration will be created
  + resource "azapi_resource" "maintenance_configuration" {
      + body                      = {
          + properties = {
              + extensionProperties = {
                  + InGuestPatchMode = "User"
                }
              + installPatches      = {
                  + linuxParameters   = {
                      + classificationsToInclude  = [
                          + "Critical",
                          + "Security",
                        ]
                      + packageNameMasksToExclude = []
                      + packageNameMasksToInclude = []
                    }
                  + rebootSetting     = "IfRequired"
                  + windowsParameters = {
                      + classificationsToInclude  = [
                          + "Critical",
                          + "Security",
                        ]
                      + excludeKbsRequiringReboot = null
                      + kbNumbersToExclude        = []
                      + kbNumbersToInclude        = []
                    }
                }
              + maintenanceScope    = "InGuestPatch"
              + maintenanceWindow   = {
                  + duration           = "2:00"
                  + expirationDateTime = null
                  + recurEvery         = "7Day"
                  + startDateTime      = "2025-05-04 00:00"
                  + timeZone           = "Eastern Standard Time"
                }
              + visibility          = "Custom"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus2"
      + name                      = "TestConfig2"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/4bcc135f-80a8-482f-b67b-fc849aa4b7ac/resourceGroups/Testrg1"
      + schema_validation_enabled = true
      + type                      = "Microsoft.Maintenance/maintenanceConfigurations@2023-04-01"
    }

  # module.avm-res-maintenance-maintenanceconfiguration2.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-res-maintenance-maintenanceconfiguration/azurerm"
          + "module_version"  = "0.1.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "4bcc135f-80a8-482f-b67b-fc849aa4b7ac"
          + "tenant_id"       = "71356f31-4de2-4bc5-9778-f530a487e6dc"
        }
    }

  # module.avm-res-maintenance-maintenanceconfiguration2.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Run status: planned and saved (confirmable)
Workspace is unlocked
```
</details>